loadtest.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60      # test length in seconds
      arrivalCount: 3000   # total users spawned instantly
  engines:
    http: {}

scenarios:
  - name: "Login Only"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "slanesh@gmail.com"
            password: "Slanesh@5002"